app/controllers/api/v1/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
    def index
        tasks = Task.all.sort_by{ |task| task.date_to_do}